import re
refind = re.findall(r"\d{11}", "我的电话号码是17859530620，我女朋友的手机号是12345678910，我们还有一个废弃手机号123123123，国外手机号是123456789001")
print(refind)   #输出列表
print('-'*20)
it = re.finditer(r'\d{11}',"我的电话号码是17859530620，我女朋友的手机号是12345678910，我们还有一个废弃手机号123123123，国外手机号是123456789001")
for i in it:
    print(i.group())    #通过group函数拿到内容
print()
print('-'*20)
research = re.search(r"\d{11}", "我的电话号码是17859530620，我女朋友的手机号是12345678910，我们还有一个废弃手机号123123123，国外手机号是123456789001")
print(research.group()) #search全文匹配，检查到一个就返回，可以用于检查存在
print('-'*20)
rematch = re.match(r"\d{11}","17859530620，我女朋友的手机号是12345678910，我们还有一个废弃手机号123123123，国外手机号是123456789001")
print(rematch.group())  #match从头匹配，
print('-'*20)
obj = re.compile(r"\d+")
ret = obj.finditer("我的电话号码是17859530620，我女朋友的手机号是12345678910，我们还有一个废弃手机号123123123，国外手机号是123456789001")
for it in ret:
    print(it.group())